Repository: dimontururu/Diploma-project
Catalog: TaskSlayerfrontendTGBot/Infrastructure/Localization/Messages.*.resx
Languages: kk_kz, ru

# ButtonADDToDoList
source: ➕ Add list
kk_kz: ➕ Тізім қосу
ru: ➕ Добавить список

# ButtonLanguage
source: 🌐 Language
kk_kz: 🌐 Тіл
ru: 🌐 Язык

# ButtonLanguageEnglish
source: 🇬🇧 English
kk_kz: 🇬🇧 Ағылшын тілі
ru: 🇬🇧 Английский

# ButtonLanguageKazakh
source: 🇰🇿 Kazakh
kk_kz: 🇰🇿 Қазақ тілі
ru: 🇰🇿 Казахский

# ButtonLanguageRussian
source: 🇷🇺 Russian
kk_kz: 🇷🇺 Орыс тілі
ru: 🇷🇺 Русский

# ButtonMenu
source: 📋 Menu
kk_kz: 📋 Мәзір
ru: 📋 Меню

# ButtonSetting
source: ⚙️Setting
kk_kz: ⚙️Параметрлер
ru: ⚙️Настройки

# ButtonToDoList
source: 📋My lists
kk_kz: 📋Менің тізімдерім
ru: 📋Мои списки

# Help
source: 🆘 Help for TaskSlayer Heroes You're not alone in this battle! Here’s what you can do: ✅ /To_do_list — your list of all quests (ToDo-lists) 📋 /list — current tasks inside a list 🏆 /Award — your progress, experience, and rewards ⚙️ /Setting — your settings 🛠 Questions about the bot? Message: @dimon_tururu Forward, hero! The world awaits your triumphs!
kk_kz: 🆘 TaskSlayer Батырларына Көмек Сіз осы шайқаста жалғыз емессіз! Мына әрекеттерді орындауға болады: ✅ /To_do_list — барлық тапсырмаларыңыздың тізімі (ToDo) 📋 /list — тізім ішіндегі ағымдағы тапсырмалар 🎯 /goals — ұзақ мерзімді мақсаттар 🏆 /stats — сіздің жетістіктеріңіз, тәжірибе және сыйақылар ⚙️ /Setting — баптауларыңыз 🛠 Ботпен жұмысқа қатысты сұрақтар? Жазыңыз: @SupportTaskSlayer Алға, батыр! Әлем сенің жетістіктеріңді күтуде!
ru: 🆘 Помощь героям TaskSlayer Ты не один в этом бою! Вот что ты можешь делать: ✅ /To_do_list — список всех твоих квестов (ToDo-листов) 📋 /list — текущие задания внутри списка 🏆 /Award — твой прогресс, опыт и награды ⚙️ /Setting — твои настройки 🛠 Вопросы по работе бота? Напиши сюда: @dimon_tururu Вперёд, герой! Мир ждёт твоих свершений!

# LanguageSetConfirmation
source: ✅ Language has been set
kk_kz: ✅ Тіл орнатылды
ru: ✅ Язык установлен

# Menu
source: 🏰 TaskSlayer Main Menu\n\nChoose where to start:\n\n✅ /To_do_list — your to-do lists\n🏆 /Awards — your awards\n🏰 /Menu — takes you back to the menu\n⚙️ /Setting — your settings\n💙 /help — help and tips\n\n💪 Win tasks — become a hero!
kk_kz: 🏰 TaskSlayer негізгі мәзірі\n\nБастау орнын таңдаңыз:\n\n✅ /To_do_list — істер тізімдері\n🏆 /Awards — марапаттарыңыз\n🏰 /Menu — сізді мәзірге қайтарады\n⚙️ /Setting — сіздің баптауларыңыз\n💙 /help — тапсырманы жеңіп алыңыз!
ru: 🏰 Главное меню TaskSlayer\n\nВыбери, с чего начнем:\n\n✅ /To_do_list — твои списки дел\n🏆 /Awards — твои награды\n🏰 /Menu — вернёт тебя в меню\n⚙️ /Setting — твои настройки\n💙 /help — помощь и подсказки\n\n💪 Побеждай задачи — становись героем!

# Title
source: 📋 <b>Title</b>
kk_kz: 📋 <b>Атауы</b>
ru: 📋 <b>Название</b>

# RequestCreateToDoList
source: 📭 You don't have any task lists yet. Create your first one and begin your journey to productivity! ⚔️
kk_kz: 📭 Әзірге ешқандай тапсырма тізімің жоқ. Алғашқы тізімді жасап, өнімділік жолын баста! ⚔️
ru: 📭 У тебя пока нет ни одного списка дел. Создай свой первый список и начни путь продуктивного героя! ⚔️

# SelectLanguage
source: 🌐 Choose a language
kk_kz: 🌐 Тілді таңдаңыз
ru: 🌐 Выберите язык

# Welcome
source: Hello, friend 👋 🎮 Welcome to TaskSlayer — your gamified Todo list! You are a hero in the world of tasks, and every checkbox is a victory over chaos! 🌟 📜 How it works: Add tasks like quests. Check them off — gain XP and level up. Earn achievements and battle procrastination! ⚔️ Your tools: ✅ /To_do_list — your to-do lists 🏆 /Awards — your rewards 🏰 /Menu — back to main menu ⚙️ /Setting — your settings 💙 /help — help and tips 🔥 Ready to become a productivity legend? Let’s go!
kk_kz: Сәлем, досым 👋 🎮 TaskSlayer-ға қош келдің — бұл сенің ойын түріндегі тапсырма тізімің! Сен — тапсырмалар әлеміндегі қаһармансың, әрбір чекбокс — тәртіпсіздікке қарсы жеңіс! 🌟 📜 Қалай жұмыс істейді? Тапсырмаларды квест ретінде қос. Орындап белгілеген сайын — тәжірибе жинап, деңгей арттыр. Жетістіктерге жетіп, жалқаулықпен күрес! ⚔️ Құралдарың: ✅ /To_do_list — тапсырмалар тізімі 🏆 /Awards — марапаттарың 🏰 /Menu — басты мәзірге оралу ⚙️ /Setting — баптауларың 💙 /help — көмек пен кеңестер 🔥 Өнімділіктің аңызына айналуға дайынсың ба? Онда алға!
ru: Привет, друг 👋 🎮 Добро пожаловать в TaskSlayer — твой игровой Todo-лист! Ты — герой в мире задач, и каждый чекбокс — это победа над хаосом! 🌟 📜 Как это работает? Добавляй задачи, как квесты. Отмечай выполненные задачи — получай опыт и уровни. Зарабатывай достижения и сражайся с прокрастинацией! ⚔️ Твои инструменты: ✅ /To_do_list — твои списки дел 🏆 /Awards — твои награды 🏰 /Menu — вернёт тебя в меню ⚙️ /Setting — твои настройки 💙 /help — помощь и подсказки 🔥 Готов стать легендой продуктивности? Тогда в бой!

# WhatWouldYouChange
source: 🛠 What would you like to change?
kk_kz: 🛠 Сіз не өзгерткіңіз келеді?
ru: 🛠 Что бы вы изменили?

# YourLists
source: <b>🗂 Your lists:</b>
kk_kz: <b>🗂 Тізімдеріңіз:</b>
ru: <b>🗂 Ваши списки:</b>

# Goals
source: 🎯 <b>Goals</b>
kk_kz: 🎯 <b>Мақсаттар</b>
ru: 🎯 <b>Целей</b>

# Completed
source: ✅ <b>Completed</b>
kk_kz: ✅ <b>Аяқталған</b>
ru: ✅ <b>Выполнено</b>

# Progress
source: 🔄 <b>In progress</b>
kk_kz: 🔄 <b>Үдерісте</b>
ru: 🔄 <b>В процессе</b>

# Overdue
source: ⏳ <b>Overdue</b>
kk_kz: ⏳ <b>Кешіктірілген</b>
ru: ⏳ <b>Просроченные</b>

# ButtonDeleteToDoList
source: Delete List 🗑️
kk_kz: Тізімді жою 🗑️
ru: Удалить список 🗑️

# AddListEnterNamePrompt
source: 📝 Enter a name for your new task list. Make it something memorable! ✨
kk_kz: 📝 Жаңа тапсырмалар тізіміне атау енгізіңіз. Есте қаларлықтай атау ойлап табыңыз! ✨
ru: 📝 Введи имя для нового списка задач. Придумай что-нибудь запоминающееся! ✨

# ListAddedSuccess
source: ✅ List added successfully! Ready for new quests! 🚀
kk_kz: ✅ Тізім сәтті қосылды! Жаңа тапсырмаларға дайынсыз! 🚀
ru: ✅ Список успешно добавлен! Готов к новым задачам! 🚀

# ErrorInvalidNameOrTooLong
source: 👮‍♂️ Halt! The name is invalid. Use only letters, numbers, and no more than 50 characters. Try again!
kk_kz: 👮‍♂️ Тоқта! Атау жарамсыз. Тек әріптер мен сандар, ұзындығы 50 таңбадан аспауы керек. Қайта енгізіңіз!
ru: 👮‍♂️ Остановитесь! Имя недопустимо. Только буквы, цифры и не длиннее 50 символов. Попробуйте ещё раз!

# ListLimitError
source: ❗ Limit reached! You cannot create more than 10 lists
kk_kz: ❗ Шек қою ауқымы асырылды! 10 тізімнен артық жасауға болмайды.
ru: ❗ Превышен лимит! Вы не можете создать более 10 списков.

# DeleteListEnterNamePrompt
source: 🗑 Please enter the name of the list you want to delete.
kk_kz: 🗑 Өшіру үшін тізімнің атауын енгізіңіз.
ru: 🗑 Пожалуйста, введите название списка, который вы хотите удалить.

# ListDeleteedSuccess
source: ✅ List successfully deleted! Ready for new tasks! 🗂✨
kk_kz: ✅ Тізім сәтті өшірілді! Жаңа тапсырмаларға дайынмын! 🗂✨
ru: ✅ Список успешно удалён! Готов к новым задачам! 🗂✨

# ToDoListAlreadyExists
source: ⚠️ A list with this name already exists. Please choose a different name. 📝
kk_kz: ⚠️ Мұндай атауы бар тізім бұрыннан бар. Басқа атау енгізіңіз. 📝
ru: ⚠️ Список с таким названием уже существует. Попробуйте ввести другое имя. 📝

# ButtonEditToDoList
source: ✏ Edit
kk_kz: ✏ Өңдеу
ru: ✏ Изменить

# ButtonViewToDoList
source: 👁 View
kk_kz: 👁 Көру
ru: 👁 Посмотреть

# ButtonDeleteToDoListMini
source: 🗑️ Delete
kk_kz: 🗑️ Тізімді
ru: 🗑️ Удалить

# EditListEnterNamePrompt
source: 📝 Enter a new name for the task list.
kk_kz: 📝 Тапсырмалар тізімі үшін жаңа атау енгізіңіз.
ru: 📝 Введи новое имя для списка задач.

# RequestCreateCases
source: 📝 You don’t have any to-do lists yet. 👉 Let’s create your first one — just tap the button below! 🚀
kk_kz: 📝 Сіздің ешқандай тапсырмалар тізіміңіз жоқ. 👉 Алғашқысын бірге құрайық — төмендегі батырманы басыңыз! 🚀
ru: 📝 Пока у тебя нет ни одного списка дел. 👉 Давай создадим первый — просто нажми кнопку ниже! 🚀

# ButtonADDCase
source: ➕ Add task
kk_kz: ➕ Тапсырма қосу
ru: ➕ Добавить задачу

# ButtonDeleteCase
source: Delete Task 🗑️
kk_kz: Тапсырманы жою 🗑️
ru: Удалить задачу 🗑️

# Status
source: 📝 <b>Task Status</b>
kk_kz: 📝 <b>Тапсырманың күйі</b>
ru: 📝 <b>Статус задачи</b>

# StatusOverdue
source: Overdue ❗️
kk_kz: Мерзімі өтіп кеткен ❗️
ru: Просрочено ❗️

# StatusCompleted
source: Completed ✅
kk_kz: Аяқталды ✅
ru: Завершено ✅

# StatusNotCompleted
source: In Progress ⏳
kk_kz: Орындау үстінде ⏳
ru: В процессе ⏳

# EndDate
source: 🗓 <b>Due</b>
kk_kz: 🗓 <b>Дейін</b>
ru: 🗓 <b>До</b>

# AddCaseEnterNamePrompt
source: 📝 Enter a name for the new task. Think of something memorable! ✨
kk_kz: 📝 Жаңа тапсырма үшін атау енгізіңіз. Есте қалатын нәрсені ойлаңыз! ✨
ru: 📝 Введи имя для новой задачи. Придумай что-нибудь запоминающееся! ✨

# EnterTaskDueDate
source: 📅 Please enter the due date for the task
kk_kz: 📅 Тапсырманың аяқталу күнін енгізіңіз
ru: 📅 Пожалуйста, введите дату окончания задачи

# TaskCreatedSuccessfully
source: ✅ Task successfully created! Ready to get it done 💪
kk_kz: ✅ Тапсырма сәтті құрылды! Орындауға дайын 💪
ru: ✅ Задача успешно создана! Готово к выполнению 💪

# ErrorInvalidDate
source: 📅 Invalid date format! Please enter the date in the format: <b>dd.MM.yyyy</b> For example: <i>14.06.2025</i>
kk_kz: 📅 Күн форматы қате! Күнді <b>кк.аа.жжжж</b> форматында енгізіңіз Мысалы: <i>14.06.2025</i>
ru: 📅 Неверный формат даты! Пожалуйста, введите дату в формате: <b>дд.мм.гггг</b> Например: <i>14.06.2025</i>

# CaseDeleteedSuccess
source: ✅ Task successfully deleted!
kk_kz: ✅ Тапсырма сәтті жойылды!
ru: ✅ Задача успешна удалена!

# AwardGranted
source: 🎉 Congratulations! You've earned a new award! 🏆 Check it out with: /Award
kk_kz: 🎉 Құттықтаймыз! Жаңа марапат алдың! 🏆 Көру үшін /Award командасын қолдан.
ru: 🎉 Поздравляем! Ты получил новую награду! 🏆 Проверь её с помощью команды: /Award

# ButtonCompleted
source: ✅Completed
kk_kz: ✅Аяқталған
ru: ✅Выполнено

# ButtonAward
source: 🏆 Awards
kk_kz: 🏆 Марапаттары
ru: 🏆 Награды

# NoAwardsText
source: You don’t have any awards yet 🏅 Complete tasks and the rewards will come! Every completed quest is a chance for a rare bonus ✨
kk_kz: Сенде әлі марапаттар жоқ 🏅 Тапсырмаларды орында, марапаттар міндетті түрде келеді! Әр аяқталған іс — сирек бонус алуға мүмкіндік ✨
ru: У тебя пока нет наград 🏅 Выполняй задачи, и награды обязательно найдут тебя! Каждая выполненная задача — шанс получить редкий бонус ✨

# AwardsText
source: 🏆 Your Awards:
kk_kz: 🏆 Сенің марапаттарың:
ru: 🏆 Твои награды:

# UnknownMessage
source: 🤔 Hmm, I’m not sure what to do with that... If you're lost, try using 💙 /help to get some guidance.
kk_kz: 🤔 Мен бұл хабарламамен не істеу керектігін білмей тұрмын... Егер неден бастарыңды білмесең — 💙 /help пәрменін қолданып көр.
ru: 🤔 Похоже, я не понимаю, что с этим делать… Если ты не знаешь, с чего начать — воспользуйся командой 💙 /help.
